{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "functional_1", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_3"}, "registered_name": null, "name": "input_layer_3", "inbound_nodes": []}, {"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "convnext_tiny", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_2"}, "registered_name": null, "name": "input_layer_2", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "stem_conv", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 96, "kernel_size": [4, 4], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"seed": null, "minval": -0.14433756729740646, "maxval": 0.14433756729740646}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 224, 224, 3]}, "name": "stem_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 224, 224, 3], "dtype": "float32", "keras_history": ["input_layer_2", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "stem_ln", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stem_ln", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stem_conv", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "ZeroPadding2D", "config": {"name": "stack1_block1_pad", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stack1_block1_pad", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stem_ln", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "stack1_block1_dw_conv", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "depth_multiplier": 1, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "depthwise_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"seed": null, "minval": -0.014580296087995107, "maxval": 0.014580296087995107}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 62, 62, 96]}, "name": "stack1_block1_dw_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 62, 62, 96], "dtype": "float32", "keras_history": ["stack1_block1_pad", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "stack1_block1_ln", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stack1_block1_ln", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block1_dw_conv", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "stack1_block1_up_dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stack1_block1_up_dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block1_ln", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "stack1_block1_gelu", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "activation": "gelu"}, "registered_name": null, "name": "stack1_block1_gelu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 384], "dtype": "float32", "keras_history": ["stack1_block1_up_dense", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "stack1_block1_down_dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 384]}, "name": "stack1_block1_down_dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 384], "dtype": "float32", "keras_history": ["stack1_block1_gelu", 0, 0]}}], "kwargs": {}}]}, {"module": "keras_cv_attention_models.mlp_family.res_mlp", "class_name": "ChannelAffine", "config": {"name": "stack1_block1_gamma", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "use_bias": false, "axis": -1}, "registered_name": "resmlp>ChannelAffine", "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stack1_block1_gamma", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block1_down_dense", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "stack1_block1_output", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}}, "registered_name": null, "build_config": {"input_shape": [[null, 56, 56, 96], [null, 56, 56, 96]]}, "name": "stack1_block1_output", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stem_ln", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block1_gamma", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "ZeroPadding2D", "config": {"name": "stack1_block2_pad", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stack1_block2_pad", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block1_output", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "stack1_block2_dw_conv", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "depth_multiplier": 1, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "depthwise_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"seed": null, "minval": -0.014580296087995107, "maxval": 0.014580296087995107}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 62, 62, 96]}, "name": "stack1_block2_dw_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 62, 62, 96], "dtype": "float32", "keras_history": ["stack1_block2_pad", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "stack1_block2_ln", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stack1_block2_ln", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block2_dw_conv", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "stack1_block2_up_dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stack1_block2_up_dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block2_ln", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "stack1_block2_gelu", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "activation": "gelu"}, "registered_name": null, "name": "stack1_block2_gelu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 384], "dtype": "float32", "keras_history": ["stack1_block2_up_dense", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "stack1_block2_down_dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 384]}, "name": "stack1_block2_down_dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 384], "dtype": "float32", "keras_history": ["stack1_block2_gelu", 0, 0]}}], "kwargs": {}}]}, {"module": "keras_cv_attention_models.mlp_family.res_mlp", "class_name": "ChannelAffine", "config": {"name": "stack1_block2_gamma", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "use_bias": false, "axis": -1}, "registered_name": "resmlp>ChannelAffine", "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stack1_block2_gamma", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block2_down_dense", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "stack1_block2_drop", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "rate": 0.005555555555555556, "seed": null, "noise_shape": [null, 1, 1, 1]}, "registered_name": null, "name": "stack1_block2_drop", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block2_gamma", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "stack1_block2_output", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}}, "registered_name": null, "build_config": {"input_shape": [[null, 56, 56, 96], [null, 56, 56, 96]]}, "name": "stack1_block2_output", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block1_output", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block2_drop", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "ZeroPadding2D", "config": {"name": "stack1_block3_pad", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stack1_block3_pad", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block2_output", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "stack1_block3_dw_conv", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "depth_multiplier": 1, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "depthwise_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"seed": null, "minval": -0.014580296087995107, "maxval": 0.014580296087995107}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 62, 62, 96]}, "name": "stack1_block3_dw_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 62, 62, 96], "dtype": "float32", "keras_history": ["stack1_block3_pad", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "stack1_block3_ln", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stack1_block3_ln", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block3_dw_conv", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "stack1_block3_up_dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stack1_block3_up_dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block3_ln", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "stack1_block3_gelu", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "activation": "gelu"}, "registered_name": null, "name": "stack1_block3_gelu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 384], "dtype": "float32", "keras_history": ["stack1_block3_up_dense", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "stack1_block3_down_dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 384]}, "name": "stack1_block3_down_dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 384], "dtype": "float32", "keras_history": ["stack1_block3_gelu", 0, 0]}}], "kwargs": {}}]}, {"module": "keras_cv_attention_models.mlp_family.res_mlp", "class_name": "ChannelAffine", "config": {"name": "stack1_block3_gamma", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "use_bias": false, "axis": -1}, "registered_name": "resmlp>ChannelAffine", "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stack1_block3_gamma", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block3_down_dense", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "stack1_block3_drop", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "rate": 0.011111111111111112, "seed": null, "noise_shape": [null, 1, 1, 1]}, "registered_name": null, "name": "stack1_block3_drop", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block3_gamma", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "stack1_block3_output", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}}, "registered_name": null, "build_config": {"input_shape": [[null, 56, 56, 96], [null, 56, 56, 96]]}, "name": "stack1_block3_output", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block2_output", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block3_drop", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "stack2_downsample_ln", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stack2_downsample_ln", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack1_block3_output", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "stack2_downsample_conv", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "filters": 192, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"seed": null, "minval": -0.051031036307982884, "maxval": 0.051031036307982884}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "stack2_downsample_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["stack2_downsample_ln", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "ZeroPadding2D", "config": {"name": "stack2_block1_pad", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "stack2_block1_pad", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_downsample_conv", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "stack2_block1_dw_conv", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "depth_multiplier": 1, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "depthwise_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"seed": null, "minval": -0.010309826235529031, "maxval": 0.010309826235529031}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 34, 34, 192]}, "name": "stack2_block1_dw_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 34, 34, 192], "dtype": "float32", "keras_history": ["stack2_block1_pad", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "stack2_block1_ln", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "stack2_block1_ln", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block1_dw_conv", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "stack2_block1_up_dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "stack2_block1_up_dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block1_ln", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "stack2_block1_gelu", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "activation": "gelu"}, "registered_name": null, "name": "stack2_block1_gelu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 768], "dtype": "float32", "keras_history": ["stack2_block1_up_dense", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "stack2_block1_down_dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 768]}, "name": "stack2_block1_down_dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 768], "dtype": "float32", "keras_history": ["stack2_block1_gelu", 0, 0]}}], "kwargs": {}}]}, {"module": "keras_cv_attention_models.mlp_family.res_mlp", "class_name": "ChannelAffine", "config": {"name": "stack2_block1_gamma", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "use_bias": false, "axis": -1}, "registered_name": "resmlp>ChannelAffine", "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "stack2_block1_gamma", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block1_down_dense", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "stack2_block1_drop", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "rate": 0.01666666666666667, "seed": null, "noise_shape": [null, 1, 1, 1]}, "registered_name": null, "name": "stack2_block1_drop", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block1_gamma", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "stack2_block1_output", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}}, "registered_name": null, "build_config": {"input_shape": [[null, 28, 28, 192], [null, 28, 28, 192]]}, "name": "stack2_block1_output", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_downsample_conv", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block1_drop", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "ZeroPadding2D", "config": {"name": "stack2_block2_pad", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "stack2_block2_pad", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block1_output", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "stack2_block2_dw_conv", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "depth_multiplier": 1, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "depthwise_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"seed": null, "minval": -0.010309826235529031, "maxval": 0.010309826235529031}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 34, 34, 192]}, "name": "stack2_block2_dw_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 34, 34, 192], "dtype": "float32", "keras_history": ["stack2_block2_pad", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "stack2_block2_ln", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "stack2_block2_ln", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block2_dw_conv", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "stack2_block2_up_dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "stack2_block2_up_dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block2_ln", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "stack2_block2_gelu", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "activation": "gelu"}, "registered_name": null, "name": "stack2_block2_gelu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 768], "dtype": "float32", "keras_history": ["stack2_block2_up_dense", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "stack2_block2_down_dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 768]}, "name": "stack2_block2_down_dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 768], "dtype": "float32", "keras_history": ["stack2_block2_gelu", 0, 0]}}], "kwargs": {}}]}, {"module": "keras_cv_attention_models.mlp_family.res_mlp", "class_name": "ChannelAffine", "config": {"name": "stack2_block2_gamma", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "use_bias": false, "axis": -1}, "registered_name": "resmlp>ChannelAffine", "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "stack2_block2_gamma", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block2_down_dense", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "stack2_block2_drop", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "rate": 0.022222222222222223, "seed": null, "noise_shape": [null, 1, 1, 1]}, "registered_name": null, "name": "stack2_block2_drop", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block2_gamma", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "stack2_block2_output", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}}, "registered_name": null, "build_config": {"input_shape": [[null, 28, 28, 192], [null, 28, 28, 192]]}, "name": "stack2_block2_output", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block1_output", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block2_drop", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "ZeroPadding2D", "config": {"name": "stack2_block3_pad", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "stack2_block3_pad", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block2_output", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "stack2_block3_dw_conv", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "depth_multiplier": 1, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "depthwise_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"seed": null, "minval": -0.010309826235529031, "maxval": 0.010309826235529031}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 34, 34, 192]}, "name": "stack2_block3_dw_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 34, 34, 192], "dtype": "float32", "keras_history": ["stack2_block3_pad", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "stack2_block3_ln", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "stack2_block3_ln", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block3_dw_conv", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "stack2_block3_up_dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "stack2_block3_up_dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block3_ln", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "stack2_block3_gelu", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "activation": "gelu"}, "registered_name": null, "name": "stack2_block3_gelu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 768], "dtype": "float32", "keras_history": ["stack2_block3_up_dense", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "stack2_block3_down_dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 768]}, "name": "stack2_block3_down_dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 768], "dtype": "float32", "keras_history": ["stack2_block3_gelu", 0, 0]}}], "kwargs": {}}]}, {"module": "keras_cv_attention_models.mlp_family.res_mlp", "class_name": "ChannelAffine", "config": {"name": "stack2_block3_gamma", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "use_bias": false, "axis": -1}, "registered_name": "resmlp>ChannelAffine", "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "stack2_block3_gamma", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block3_down_dense", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "stack2_block3_drop", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "rate": 0.027777777777777776, "seed": null, "noise_shape": [null, 1, 1, 1]}, "registered_name": null, "name": "stack2_block3_drop", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block3_gamma", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "stack2_block3_output", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}}, "registered_name": null, "build_config": {"input_shape": [[null, 28, 28, 192], [null, 28, 28, 192]]}, "name": "stack2_block3_output", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block2_output", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block3_drop", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "stack3_downsample_ln", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 192]}, "name": "stack3_downsample_ln", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["stack2_block3_output", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "stack3_downsample_conv", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 136123465244144}, "filters": 384, "kernel_size": [2, 2], "strides": [2, 2], 